const app = Vue.createApp({
    data: function() {
        return {
            items: [
                { 
                    title: 'OMEGA-3 PLUS_180 капсул',
                    text: '«ОМЕГА-3 ПЛЮС»: Синергия ПРИРОДЫ в ПРАВИЛЬНЫХ концентрациях! Мы воссоздали уникальную витаминную формулу рыбьего жира, усилив концентрацию ПНЖК до 60% в форме ЭТИЛОВОГО ЭФИРА ЭФФЕКТИВЕН ПРИ: Подготовке и планировании беременности, а также в период беременности и кормления для полноценного развития нервной и сердечно-сосудистой систем ребенка',
                    isOpen: false,
                },
                { 
                    title: 'МАГНИЙ 400_30 саше',
                    text: 'ЭФФЕКТИВЕН ДЛЯ: Защиты головного мозга и ЦНС от стресса, нормализации уровня кортизола Aктивизации мозговой деятельности: улучшение памяти и когнитивных способностей Поддержка работы сердца и мышечного тонуса Регуляции артериального давления и сердечного ритмаПрофилактики инсулинорезистентности и повышения чувствительности к инсулину Профилактики желчекаменной и мочекаменной болезней Регуляции уровня холестеринаРегулирование минерализации костной ткани',
                    isOpen: false,
                },
                { 
                    title: 'SSSSSSS',
                    text: '7777777777788 2321111111111111111111s321111111111111sdfsdfsdf32s1df321s32f1d32sf1d3sdf13sdf13s21df3s2f1d',
                    isOpen: false,
                },
            ]
        };
    },
    methods: {
        openItem: function(index) {
            this.items[index].isOpen = !this.items[index].isOpen;
        }

    }
});

app.mount('#app');